In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv('attendance.csv')
df.head()

,Unnamed: 0,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
0,Sally,P,T,T,H,P,A,T,T
1,Jane,A,P,T,T,T,T,A,T
2,Billy,A,T,A,A,H,T,P,T
3,John,P,T,H,P,P,T,P,P

In [4]:
df.columns

Index(['Unnamed: 0', '2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
       '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08'],
      dtype='object')

In [95]:
df = pd.read_csv('attendance.csv')
df = df.melt(id_vars='Unnamed: 0')
df['day'] = df.variable.str[-2:]
df.drop(columns='variable', inplace=True)
df = df.rename(columns={'Unnamed: 0': 'name'})
df.head()

    name value day
0  Sally     P  01
1   Jane     A  01
2  Billy     A  01
3   John     P  01
4  Sally     T  02

In [34]:

df = df.replace({'P':1, 'A':0, 'H':.5, 'T':.9})
df.groupby('name').mean()

        value
name
Billy  0.5250
Jane   0.6875
John   0.9125
Sally  0.7625

# Problem 2

In [42]:
df = pd.read_csv('coffee_levels.csv')
df.head()

   hour coffee_carafe  coffee_amount
0     8             x       0.816164
1     9             x       0.451018
2    10             x       0.843279
3    11             x       0.335533
4    12             x       0.898291

In [47]:
df = pd.read_csv('coffee_levels.csv')
df = df.pivot_table(values='coffee_amount', index='hour', 
               columns='coffee_carafe').reset_index()
df.columns.name = ''
df.head()
# df.index = df.hour
# df.drop(columns='hour')

   hour         x         y         z
0     8  0.816164  0.189297  0.999264
1     9  0.451018  0.521502  0.915990
2    10  0.843279  0.023163  0.144928
3    11  0.335533  0.235529  0.311495
4    12  0.898291  0.017009  0.771947

I would say this is not the best shape for the data, since it is now not obvious what the continuous data is measuring

# Problem 3

In [113]:
df = pd.read_csv('cake_recipes.csv')
df = df.melt(id_vars='recipe:position')
df['recipe'] = df['recipe:position'].str[:1]
df['position'] = df['recipe:position'].str[2:]
df.drop(columns='recipe:position', inplace=True)
df = df.rename(columns={'variable':'temperature', 'value':'score'})
df.head()
df.groupby('recipe').mean().sort_values(
    'score', ascending=False).reset_index().iloc[0].tolist()

['b', 76.73607424644435]

In [114]:
df.groupby('temperature').mean().sort_values(
    'score', ascending=False).reset_index().iloc[0].tolist()

['275', 74.88675386649831]

In [115]:
df.head()

  temperature      score recipe position
0         225  61.738655      a   bottom
1         225  51.709751      a      top
2         225  57.095320      b   bottom
3         225  82.455004      b      top
4         225  96.470207      c   bottom

In [118]:
df.groupby(['recipe','position','temperature']).mean()\
    .reset_index().sort_values('score', ascending=False)\
    .iloc[0].tolist()

['b', 'bottom', '300', 99.2485405378462]